[
    {
        "token": "iot",
        "link": "https://medium.com/@ramjaju3737/significance-of-real-time-processing-in-embedded-systems-0aff9b4cfb35?source=tag_archive---------265----------------------------",
        "title": "Significance of real-time processing in embedded systems.",
        "subtitle": "false",
        "autorName": "Ram C. Jaju",
        "imageAutor": "https://miro.medium.com/v2/resize:fill:44:44/0*_APhh4k_aPxjEsfZ",
        "clap": "3",
        "response": "1",
        "timeForRead": "2 min read",
        "dateCreate": "Oct 11",
        "text": [
            "For Internet of Things IOT applications where prompt decision-making is crucial, real-time processing in embedded systems is necessary. Embedded systems immediately process information, whether they are monitoring industrial machinery or gathering sensor data in smart homes. IoT devices are more effective and responsive thanks to its real-time capacity, which ensures swift response to changing conditions.\n",
            "To address the strict timing requirements of real-time IoT applications, advanced microcontrollers with rapid clock rates and optimised algorithms are used. Model-Based Design MBD training successfully manages the complexity of embedded systems through hierarchical modelling and abstraction. Modular parts that are each represented by a model are used to disassemble complex systems. The functionality of the system can be more easily understood thanks to this abstraction. Additionally, modifications to a model can spread throughout the entire system, maintaining consistency and lowering the risk of errors.\n",
            "The importance of real-time processing resides in ensuring rapid and accurate control over crucial functions in automotive embedded systems and Electric Vehicles (EV) embedded systems. For controlling functions like battery monitoring, motor control, and safety features in EVs, real-time processing is essential. This enables quick modifications for the best performance and safety. Similar to this, real-time processing is necessary in traditional automotive embedded systems for features like electronic stability control (ESC) and anti-lock brake systems (ABS), where split-second judgements can avert accidents and improve overall vehicle safety. Real-time processing ensures that these embedded systems react quickly to altering circumstances, enhancing the effectiveness, safety, and dependability of both conventional and electric vehicles.\n"
        ],
        "tagsPost": [
            "embedded-systems",
            "electric-vehicles",
            "matlab",
            "iot",
            "automotive"
        ]
    },
    {
        "token": "iot",
        "link": "https://medium.com/@matthewdavidbetty/securing-the-iot-landscape-how-digital-identity-rebuilds-trust-acbffdbd4b1b?source=tag_archive---------108----------------------------",
        "title": "Securing the IoT Landscape: How Digital Identity Rebuilds Trust",
        "subtitle": "false",
        "autorName": "Matthew David Betty",
        "imageAutor": "https://miro.medium.com/v2/resize:fill:44:44/1*-6xP5n96MRfkHgcyh-VlKg.jpeg",
        "clap": "26K",
        "response": "647",
        "timeForRead": "3 min read",
        "dateCreate": "Oct 20",
        "text": [
            "In an age where data is essential for decision-making, the Internet of Things (IoT) is transforming how we interact with the world. IoT is everywhere, whether it is in smart homes, construction sites, or health devices. This upward trend of IoT adoption only promises to continue, and with this adoption comes a whole set of opportunities and challenges. The future is bright when it comes to IoT, however, with the expanding use cases of these devices and the large quantities of data being produced, there are no systems in place to ensure the integrity of the data.\n",
            "As exciting as this adoption of IoT is, it comes with an inherent trust issue. How can you be certain the data your smart devices are sending is both accurate and coming from the promised source? As an individual, you are not able to verify this but instead are forced to trust the application and data providers. For some use cases, this may not be an issue, however when these devices are being used for safety, or to monitor critical infrastructure. A breach in data integrity could have catastrophic consequences.\n",
            "This is where Digital Identity and Decentralized Identifiers (DIDs) come into play. These DIDs are a method of managing the digital identity of participants within the system. Similar to a National ID, a Serial Number, or a business registration number (BRN). These function as each participant’s digital signature, and as a result allow for the signing and verification of data within the system. By implementing a system where identities are binding, and data can be verified and authenticated according to the issuer of the data, it allows for a system where participants do not need to trust but instead verify themselves.\n",
            "Adding this layer of trust through digital identity doesn’t just secure an IoT ecosystem; it transforms it into a reliable infrastructure that stakeholders can genuinely trust, thereby expanding its utility and applications. Whether in construction or any other industry, this shift is more than a mere upgrade; it’s a revolution in how we interact with and think about data.\n",
            "A good way to understand the importance of this digital trust infrastructure is to first understand how it would work. Let’s delve into the construction industry where this implementation of Digital Identity and IoT is not just beneficial but critical. In this sector, a malfunctioning sensor or an illegitimate data source isn’t just a nuisance; it’s a potential catastrophe. For example, if a sensor is being used to monitor the long-term health of a structure for the management of maintenance, if that sensor fails or the data is not accurate, that could lead to a catastrophe that costs many lives. Whether it’s the structural integrity of a building or the safety of construction workers, decisions based on false data could lead to disastrous outcomes. If not paired with this digital identity infrastructure, the utility of IoT devices will significantly decrease as their data outputs will never be fully trustable.\n",
            "While construction serves as an excellent illustration, the applicability of an implementation of Digital Identity and IoT extends far beyond. Healthcare, logistics, automotive — essentially any field making use of IoT can significantly benefit from incorporating Digital Identity. It’s the trust layer that IoT so desperately needs.\n"
        ],
        "tagsPost": [
            "construction-industry",
            "digital-trust",
            "embedded-systems",
            "digital-identity",
            "electric-vehicles",
            "did",
            "matlab",
            "iot",
            "automotive"
        ]
    },
    {
        "token": "iot",
        "link": "https://medium.com/@sathishjayaram/building-a-resilient-scalable-kubernetes-setup-cloud-on-prem-best-practices-ddde438bf46b?source=tag_archive---------49----------------------------",
        "title": "Building a Resilient & Scalable Kubernetes Setup: Cloud & On-Prem Best Practices",
        "subtitle": "false",
        "autorName": "Sathish Jayaram",
        "imageAutor": "https://miro.medium.com/v2/resize:fill:44:44/0*pxIfZ5_2XhRProid.",
        "clap": "11",
        "response": "1",
        "timeForRead": "4 min read",
        "dateCreate": "false",
        "text": [
            "Last year, we at Quartic.ai tackled a requirement to execute enterprise-wide deployments for some of our clients with the following goals in mind:\n",
            "The clear choice for achieving these goals was Kubernetes orchestration. However, given the stringent data locality and internet access policies of the industries we serve (Life Sciences and F&B), setting up the necessary infrastructure presented its challenges. The idea of having dedicated deployments on various cloud providers or on-premises for each client (based on their IT preference) amplified this complexity.\n",
            "In this article, we’ll outline the key considerations for establishing an in-house, resilient, and scalable Kubernetes cluster catering to both cloud and on-premise scenarios. Our insights are drawn from our journey transitioning from a single-node Docker setup to a multi-node Kubernetes cluster.\n",
            "Selecting the right Kubernetes distribution tailored to your needs is crucial. A quick search will reveal a plethora of options, each with its unique focus. For our purposes, we sought a distribution that was nimble enough for single-node setups (ideal for Demo/PoC scenarios) yet robust enough to scale to multiple nodes. K3s emerged as the best fit for our criteria, and we subsequently adopted it as our go-to choice for in-house and on-premises deployments.\n",
            "When deploying stateful applications (a common scenario), determining how to store data resiliently in the face of node failures becomes paramount. Relying solely on StatefulSet deployments with multiple replicas isn’t always feasible for every application. Take, for instance, the management of user-uploaded files. This necessitates a distributed volume capable of handling replication, snapshots, and other functionalities internally. We opted for Longhorn, but other alternatives like OpenEBS and Ceph can also be suitable. It’s essential to note that these frameworks utilize network storage, which might be susceptible to latency issues. Therefore, it’s vital to test your workload within these environments, thoroughly review snapshot configurations, and assess recovery procedures before finalizing your choice.\n",
            "Determining which applications to scale is contingent on your specific use case. Our application is data-intensive, with the number of devices streaming to the platform varying across client deployments and potentially increasing as they expand to new sites. It’s essential to pinpoint the applications affected and craft a clear scaling strategy for them. For instance, if your architecture includes web servers and databases, it’s prudent to optimize the capacity for each pod. Additionally, consider setting up Horizontal Pod Autoscaling (HPA) to activate once pod limits approach defined thresholds — assuming your cluster has the requisite resources available for scaling.\n",
            "Based on the composition of your platform, it’s imperative to identify the critical applications that must maintain high availability (HA) to endure node failures. Typically, databases and web servers require an HA configuration. If you’re utilizing Postgres, consider Patroni as a suitable solution. For caching needs, Redis Sentinel is worth exploring. In our case, Kafka is employed for streaming data from edge devices. Given its significance, ensuring Kafka operates in HA mode was paramount. We found the Strimzi operator to be exceptionally effective for this purpose.\n",
            "Gaining visibility into your deployment is crucial, both for understanding application performance and for effective troubleshooting. We employ Grafana in tandem with Prometheus to monitor our Kubernetes cluster. Beyond the standard metrics, it’s beneficial to integrate custom events and alerts tailored to your specific use case.\n",
            "Determine the optimal number of nodes (both workers and masters) and set resource limits for your pods based on the performance and resilience needs of your stack. Beyond its core functions, Kubernetes also demands auxiliary resources to operate efficiently. Arrive at these figures by thoroughly testing your workload and understanding its resiliency prerequisites. The monitoring stack, as discussed earlier, can greatly aid in fine-tuning these configurations.\n",
            "Lastly, it’s imperative to establish a robust backup and restore strategy to safeguard against catastrophic failures. While on-premises deployments might offer fewer options, cloud providers typically furnish snapshot capabilities for VMs, which can prove invaluable. Additionally, the distributed storage frameworks and HA configurations previously discussed come equipped with backup and snapshot features. These can be set up to routinely save backups to cloud-based blob storage.\n",
            "I trust you found the insights shared above valuable. For more enlightening topics on engineering & AI, I invite you to explore the Quartic.ai blog. This article is also shared in my personal website & LinkedIn\n"
        ],
        "tagsPost": [
            "construction-industry",
            "digital-trust",
            "on-premise",
            "distributed-systems",
            "embedded-systems",
            "digital-identity",
            "electric-vehicles",
            "did",
            "kafka",
            "matlab",
            "iot",
            "kubernetes",
            "automotive"
        ]
    },
    {
        "token": "iot",
        "link": "https://medium.com/@ramjaju3737/primary-functions-of-embedded-systems-in-modern-automotive-applications-7dc7e7a4e210?source=tag_archive---------102----------------------------",
        "title": "Primary functions of embedded systems in modern automotive applications.",
        "subtitle": "false",
        "autorName": "Ram C. Jaju",
        "imageAutor": "https://miro.medium.com/v2/resize:fill:44:44/0*_APhh4k_aPxjEsfZ",
        "clap": "3",
        "response": "18",
        "timeForRead": "2 min read",
        "dateCreate": "Oct 20",
        "text": [
            "Modern automotive embedded applications rely heavily on embedded systems because they provide the covert intelligence that improves user experience, safety, and performance. Powertrain control, where embedded systems control the operation of the engine, fuel injection, and gearbox systems, is one of their main purposes. Through this optimisation, fuel economy is increased, emissions are decreased, and overall vehicle performance is improved.\n",
            "Advanced driver-assistance systems (ADAS) are a significant contribution made by embedded systems in the area of safety. With the use of sensors and algorithms, these systems offer functions like collision avoidance, lane departure warning, and adaptive cruise control, improving overall road safety and lowering the risk of accidents.\n",
            "Another important area is infotainment, where ev embedded systems power connectivity functions, navigational systems, and entertainment interfaces. These programmes manage multimedia content, work with cellphones, and give out real-time data to make sure that enriched and connected driving experience.\n",
            "Additionally, IOT embedded systems are essential for vehicle maintenance and diagnostics. Various vehicle components are monitored for health using onboard diagnostics systems, which helps with early defect detection and effective maintenance.\n",
            "Security is of the utmost importance, and embedded systems take precautions to guard against theft and unauthorised access. Encryption, secure communication protocols, and immobilisers are examples of embedded features that improve vehicle security.\n",
            "In conclusion, embedded systems are the invisible designers of effective powertrains, cutting-edge safety features, intelligent entertainment, proactive maintenance, and strong security in modern automobile applications. The development of automobiles becoming smart, interconnected, and safer modes of transportation has become fundamentally dependent on their integration.\n"
        ],
        "tagsPost": [
            "construction-industry",
            "digital-trust",
            "on-premise",
            "automation",
            "distributed-systems",
            "embedded-systems",
            "digital-identity",
            "electric-vehicles",
            "did",
            "kafka",
            "matlab",
            "iot",
            "kubernetes",
            "automotive"
        ]
    },
    {
        "token": "iot",
        "link": "https://medium.com/@shaikh-82084/rfid-and-iot-a-game-changer-for-asset-visibility-and-management-67d272075de9?source=tag_archive---------191----------------------------",
        "title": "RFID and IoT: A Game-Changer for Asset Visibility and Management",
        "subtitle": "false",
        "autorName": "Shaikh N",
        "imageAutor": "https://miro.medium.com/v2/resize:fill:44:44/0*cfS3wf0PSBI5iZtu.",
        "clap": "672",
        "response": "8",
        "timeForRead": "3 min read",
        "dateCreate": "Oct 16",
        "text": [
            "You’re running a business and need to keep track of your assets — equipment, products, tools, and more. It can be a major challenge to maintain visibility into exactly where everything is at any given time.\n",
            "But new technologies like RFID and the Internet of Things (IoT) are completely changing the game when it comes to asset management. Keep reading to learn the benefits of RFID and IoT and how they can help you achieve total asset visibility and take your operations to the next level.\n",
            "RFID (radio frequency identification) has been around for a while but is now being combined with IoT sensors and cloud-based platforms. This allows for real-time location tracking of tagged assets.\n",
            "RFID tags can be attached to items like pallets, containers, tools, and electronics. Then RFID readers placed around your facility or vehicles can automatically scan and update the location of tagged assets.\n",
            "This gives you an accurate, up-to-date record of exactly where things are at all times. No more losing track of tools or having to manually search for items. RFID offers a simple, efficient system to achieve total asset visibility.\n",
            "IoT (Internet of Things) takes RFID tracking to the next level. IoT sensors can be integrated to monitor not only the location but also the condition and usage of assets.\n",
            "For example, a sensor on a piece of equipment can track run time, temperature, vibrations, and other metrics to determine maintenance needs before failure occurs. Sensors in a storage area can monitor environmental conditions like temperature and humidity to prevent damage to sensitive inventory.\n",
            "And telematics sensors on vehicles record how they are being used — mileage, speeds, idling time, etc. IoT allows you to monitor all critical asset parameters in real time.\n",
            "The data from RFID and IoT sensors is invaluable but only if you can access it in a meaningful way. This is where cloud platforms come in. A cloud-based software system can ingest all the real-time asset data and visualize it on easy-to-use dashboards.\n",
            "You can see your entire inventory mapped out, get alerts when something is out of spec, analyze usage trends, and more. Instead of being overwhelmed with disjointed data, you get a unified operational view to unlock powerful insights. The cloud is the key to harnessing RFID and IoT into an integrated asset management solution.\n",
            "With end-to-end visibility and intelligence on all your assets, you’re in the driver’s seat when it comes to your operations. You can optimize asset utilization, eliminate lost and idle resources, prevent downtime from lack of maintenance, ensure inventory is where it needs to be, automate reordering, and make data-driven decisions.\n",
            "RFID, IoT sensors, and cloud platforms give you the foundation for a well-run, efficient business. Asset visibility is game changing when it comes to driving operational excellence.\n",
            "RFID, IoT, and the cloud are revolutionizing asset management. By tagging and tracking items in real-time, monitoring asset health and usage, and leveraging cloud analytics, you gain complete visibility across your operations.\n",
            "You can maximize productivity, minimize waste, and take your business performance to new heights. Asset management is no longer a challenge but a strategic advantage. Implementing these technologies for IoT app development can help you transform your operations today.\n"
        ],
        "tagsPost": [
            "construction-industry",
            "digital-trust",
            "on-premise",
            "automation",
            "distributed-systems",
            "embedded-systems",
            "rfid",
            "digital-identity",
            "electric-vehicles",
            "did",
            "kafka",
            "matlab",
            "iot",
            "kubernetes",
            "automotive"
        ]
    }
]
